app/controllers/otp_verifications_controller.rb

SELECT "users".* FROM "users" WHERE "users"."phone_number" = $1 LIMIT $2  [["phone_number", "+17023555315"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "failed_attempts" = $2, "locked_at" = $3 WHERE "users"."id" = $4  [["updated_at", "2024-02-25 21:42:50.860495"], ["failed_attempts", 0], ["locked_at", nil], ["id", 8]]
---
  def verify_user_otp
    user = User.find_by(phone_number: params[:phone_number])

    if user.nil?
      render json: { error: 'User not found.' }, status: :not_found
      return
    end

    if user.locked_at? && user.locked_at > 10.minutes.ago
      render json: { error: 'Account temporarily locked.' }, status: :locked
      return
    end

    is_verified = OtpVerificationService.new.check_verification(user.phone_number, params[:otp_code])
    if is_verified
      user.reset_failed_attempts
      user.update(verified: true)