app/controllers/summary_translations_controller.rb

  def index
    @summary_translations = @current_user.summary_translations.all
---
SELECT "summary_translations".* FROM "summary_translations" WHERE "summary_translations"."user_id" = $1  [["user_id", 25]]

  def create
    @summary_translation = @current_user.summary_translations.build(summary_translation_params)

    if @summary_translation.save
---
INSERT INTO "summary_translations" ("original_title", "translated_title", "original_body", "translated_body", "original_action", "translated_action", "original_language", "translation_language", "created_at", "updated_at", "user_id", "image_key", "extracted_text") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"