app/controllers/users_controller.rb

  def update_user_from_token
    if @current_user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1, "language" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-03-01 11:46:57.769417"], ["language", "en"], ["id", 8]]

  def create
    # Create a new user, or get existing user, and send verification code to phone
    @user = User.find_or_initialize_by(phone_number: user_params[:phone_number])
---
SELECT "users".* FROM "users" WHERE "users"."phone_number" = $1 LIMIT $2  [["phone_number", "+17023555315"], ["LIMIT", 1]]

  def create_temp_user
    # phone number is a uuid from frontend
    @user = User.new(user_params)
    @user.user_type = 'TEMP'
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "username", "phone_number", "verified", "failed_attempts", "locked_at", "user_type", "document_count", "language") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def destroy
    @user.destroy!
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]